Config/Catalogs/RoomTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>RoomTypes</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Hotels</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>DescriptionTranslations</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RoomClass</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.RoomTypeClasses</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>NumberOfBedsPerRoom</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>NumberOfPersonsPerRoom</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>NumberOfAdults</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>NumberOfTeenagers</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>NumberOfChildren</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>NumberOfInfants</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsVirtual</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DoesNotAffectRoomRevenueStatistics</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>StopSale</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Remarks</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SortCode</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Photo</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RoomTypePictureLink</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RoomTypeInfoLink</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>LimitedRooms</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RoomsReserv</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>MaxRoomsForChannels</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AccommodationType</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AccommodationTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BaseRoomType</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.RoomTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>WindowView</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.RoomProperties</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RoomsShouldNotBeClearedRegularly</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GroupingForReports</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsNotPermanentBuilding</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsModularStructure</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DefaultBedsSetup</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.BedsSetups</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>StopSalePeriods</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>PeriodFrom</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PeriodTo</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Remarks</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>StopSale</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>StopInternetSale</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>CreateDate</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Author</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Employees</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>AccommodationTypesAllowed</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>AccommodationType</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.AccommodationTypes</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ConnectedRoomTypes</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>RoomType</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.RoomTypes</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>AllowedBedsSetups</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>BedsSetup</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.BedsSetups</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/CommonForms/tcStopSaleMultipleRooms/Ext/Form/Module.bsl
#Region FormEventHandlers

// -----------------------------------------------------------------------------
&AtServer
Procedure OnCreateAtServer(pCancel, pStandardProcessing)
	If Not cmCheckUserPermissions("HavePermissionToStopSaleRoomTypes") And IsRoomTypes Then
		Items.StopSalePeriods.Enabled = False;
	ElsIf Not cmCheckUserPermissions("HavePermissionToStopSaleRooms") And Not IsRoomTypes Then
		Items.StopSalePeriods.Enabled = False;
	Else
		Items.StopSalePeriods.Enabled = True;	
	EndIf;
	vListRef = Undefined;
	If Parameters.Property("SelListRef") Then
		vListRef = Parameters.SelListRef; 
		If vListRef.Count() > 0 Then
			vBeginRow = True;
			For Each vItem In vListRef Do
				If vItem.Value.DeletionMark Then
					Continue;
				EndIf;
				If vBeginRow Then
					If TypeOf(vItem.Value) = Type("CatalogRef.RoomTypes") Then
						IsRoomTypes = True;	
					Else
						IsRoomTypes = False;	
					EndIf;
					vBeginRow = False;
				EndIf;
				If vItem.Value.IsFolder Then
					vArrRefs = GetArrRefByFolder(vItem.Value, vListRef, IsRoomTypes);
					For Each vRef In vArrRefs Do
						If IsRoomTypes Then
							vNewRow = ListRoomTypesRef.Add();
							vNewRow.Ref = vRef;
							vNewRow.Hotel = vRef.Owner;
							vNewRow.ParentFolder = vRef.Parent;
							vNewRow.Description = vRef.Description;
						Else
							vNewRow = ListRoomsRef.Add();
							vNewRow.Ref = vRef;
							vNewRow.Hotel = vRef.Owner;
							vNewRow.ParentFolder = vRef.Parent;
							vNewRow.Description = vRef.Description;	
						EndIf;	
					EndDo;
					Continue;
				EndIf;
				If IsRoomTypes Then
					vNewRow = ListRoomTypesRef.Add();
					vNewRow.Ref = vItem.Value;
					vNewRow.Hotel = vItem.Value.Owner;
					vNewRow.ParentFolder = vItem.Value.Parent;
					vNewRow.Description = vItem.Value.Description;
				Else
					vNewRow = ListRoomsRef.Add();
					vNewRow.Ref = vItem.Value;
					vNewRow.Hotel = vItem.Value.Owner;
					vNewRow.ParentFolder = vItem.Value.Parent;
					vNewRow.Description = vItem.Value.Description;	
				EndIf;
			EndDo;
		EndIf;
	EndIf;
	If vListRef = Undefined Or vListRef.Count() = 0 Then
		Items.StopSalePeriods.Enabled = False;
		Items.ListRoomTypesRef.Visible = False;
		Items.ListRoomsRef.Visible = False;
		Items.FormActionExecute.Enabled = False;
	ElsIf IsRoomTypes Then
		Items.ListRoomTypesRef.Visible = True;
		Items.ListRoomsRef.Visible = False;
		Items.StopSalePeriodsStopInternetSale.Visible = True;
		Items.FormActionExecute.Enabled = True;
		ListRoomTypesRef.Sort("Description, ParentFolder");
	Else
		Items.ListRoomTypesRef.Visible = False;
		Items.ListRoomsRef.Visible = True;	
		Items.StopSalePeriodsStopInternetSale.Visible = False;
		Items.FormActionExecute.Enabled = True;
		ListRoomsRef.Sort("Description, ParentFolder");
	EndIf;
EndProcedure // OnCreateAtServer

#EndRegion

#Region FormHeaderItemsEventHandlers

// -----------------------------------------------------------------------------
&AtClient
Procedure StopSalePeriodsOnStartEdit(pItem, pNewRow, pClone)
	If pNewRow Then
		pItem.CurrentData.StopSale = True;	
	EndIf;
EndProcedure // StopSalePeriodsOnStartEdit

#EndRegion

#Region FormCommandsEventHandlers

// -----------------------------------------------------------------------------
&AtClient
Procedure ActionExecute(pCommand)	
	If StopSalePeriods.Count() > 0 Then
		If ActionExecuteAtServer() Then
			Notify("tcStopSaleMultipleRooms.Execute");
			ShowMessageBox(New NotifyDescription("ShowMessageBoxCompleted", ThisForm, UUID), NStr("en = 'Completed'; de = 'Abgeschlossen'; ru = 'Завершено'"));	
		Else
			Notify("tcStopSaleMultipleRooms.Execute");
			ShowMessageBox(, NStr("en = 'An error occurred while recording stop sales'; de = 'Beim Aufzeichnen von Verkaufsstopps ist ein Fehler aufgetreten'; ru = 'Возникла ошибка при записи стоп-продаж'"));	
		EndIf;
	Else
		ShowMessageBox(, NStr("en = 'The list stop sale is empty'; de = 'Die Liste Stop Sale ist leer'; ru = 'Список стоп-продаж пуст'"));	
	EndIf;
EndProcedure // ActionExecute

#EndRegion

#Region Private

// -----------------------------------------------------------------------------
&AtServer
Function ActionExecuteAtServer()
	If IsRoomTypes Then
		vListVT = ListRoomTypesRef;
	Else
		vListVT = ListRoomsRef;	
	EndIf;
	vArrErr = New Array();
	For Each vRow In vListVT Do
		Try
			vObj = vRow.Ref.GetObject();
			vStopSalePeriods = vObj.StopSalePeriods;
			For Each vStopSaleRow In StopSalePeriods Do
				vNewStopSalePeriod = vStopSalePeriods.Add();
				If IsRoomTypes Then
					vNewStopSalePeriod.StopInternetSale = vStopSaleRow.StopInternetSale;	
				EndIf;
				vNewStopSalePeriod.PeriodFrom = vStopSaleRow.PeriodFrom;
				vNewStopSalePeriod.PeriodTo = vStopSaleRow.PeriodTo;
				vNewStopSalePeriod.Remarks = vStopSaleRow.Remarks;
				vNewStopSalePeriod.StopSale = vStopSaleRow.StopSale;
				If Not IsRoomTypes Then
					vObj.pmSetStopSaleFlag();
				Else
					vObj.StopSale = CheckStopSaleFlag(vObj);	
				EndIf;
				vNewStopSalePeriod.CreateDate = CurrentSessionDate();
				vNewStopSalePeriod.Author = SessionParameters.CurrentUser;
			EndDo;
			vObj.Write();
		Except
			vErr = ErrorDescription();
			vArrErr.Add(vRow.GetID());
			WriteLogEvent("tcStopSaleMultipleRooms.Execute", EventLogLevel.Error,,, vErr);
			tcCommonFunctionOnClientServer.TextMessage(vErr);
		EndTry;
	EndDo;
	For Each vErr In vArrErr Do
		vListVT.Delete(vListVT.FindByID(vErr));	
	EndDo;
	If vArrErr.Count() > 0 Then
		Return False;	
	Else
		Return True;	
	EndIf;
EndFunction // ActionExecuteAtServer

// -----------------------------------------------------------------------------
&AtServerNoContext
Function GetArrRefByFolder(pFolderRef, pArrRef, pIsRoomTypes)
	If pIsRoomTypes Then
		vQueryText = 
		"SELECT
		|	RoomTypes.Ref AS Ref
		|FROM
		|	Catalog.RoomTypes AS RoomTypes
		|WHERE
		|	NOT RoomTypes.DeletionMark
		|	AND NOT RoomTypes.IsFolder
		|	AND NOT RoomTypes.Ref IN (&qArrRef)
		|	AND RoomTypes.Parent = &qFolder";	
	Else
		vQueryText = 
		"SELECT
		|	Rooms.Ref AS Ref
		|FROM
		|	Catalog.Rooms AS Rooms
		|WHERE
		|	NOT Rooms.DeletionMark
		|	AND NOT Rooms.IsFolder
		|	AND NOT Rooms.Ref IN (&qArrRef)
		|	AND Rooms.Parent = &qFolder";		
	EndIf;
	vQuery = New Query();
	vQuery.Text = vQueryText;
	vQuery.SetParameter("qArrRef", pArrRef);
	vQuery.SetParameter("qFolder", pFolderRef);
	vResult = vQuery.Execute().Unload();
	Return vResult.UnloadColumn("Ref");
EndFunction // GetArrRefByFolder    

// --------------------------------------------------------------------------------
&AtServer
Function CheckStopSaleFlag(Val pObj)
	vStopSale = False;
	For Each vRow In pObj.StopSalePeriods Do
		If vRow.StopSale Or vRow.StopInternetSale Then
			If Not ValueIsFilled(vRow.PeriodFrom) And Not ValueIsFilled(vRow.PeriodTo) Then
				vStopSale = True;
				Break;
			ElsIf Not ValueIsFilled(vRow.PeriodFrom) And ValueIsFilled(vRow.PeriodTo) Then
				If vRow.PeriodTo > CurrentSessionDate() Then
					vStopSale = True;
					Break;
				EndIf;
			ElsIf ValueIsFilled(vRow.PeriodFrom) And Not ValueIsFilled(vRow.PeriodTo) Then
				vStopSale = True;
				Break;
			ElsIf ValueIsFilled(vRow.PeriodFrom) And ValueIsFilled(vRow.PeriodTo) Then
				If vRow.PeriodTo > CurrentSessionDate() Then
					vStopSale = True;
					Break;
				EndIf;
			EndIf;
		EndIf;
	EndDo;
	Return vStopSale;
EndFunction // RefreshDisplay

// -----------------------------------------------------------------------------
&AtClient
Procedure ShowMessageBoxCompleted(pExtraParam) Export 
	Close();
EndProcedure // ShowMessageBoxCompleted

#EndRegion
